"""
각 신호등별 누적합 저장 and y인 경우만 저장 + 2초 이상인 경우 전부 저장(이 경우엔 리스트 길이가 꽤나 길어질 가능성 존재, 해시로 해야 하나?)
각 신호등의 누적합 결과 중 같은 값이 있으면 해당 값 리턴, 없으면 -1리턴
"""
import math
import copy

# 1. 최소 공배수 구하기
def get_lcm(signals):
    lcm = 1
    for signal in signals:
        lcm = (lcm * sum(signal)) // math.gcd(lcm, sum(signal))
    return lcm

# 2. 각 신호등 누적합 구하기
def get_cumsum(signals):
    n = len(signals)
    signals.sort(key=lambda x: x[1], reverse=True)
    lcm = get_lcm(signals)
    cumsum = []
    
    for _ in range(n):
        cumsum.append([])
        
    cnt = 0
    for i, signal in enumerate(signals):
        f = signal[0] + signal[1]
        r = sum(signal)
        cumsum[i].append(f)
        for j in range(1, int(lcm/sum(signal))):
            cumsum[i].append(f + (r * j))
        if signal[1] != 1:
            cnt += 1
            x = copy.deepcopy(cumsum[i])
            cumsum.append(x)
            std = signal[1] - 1
            for q in cumsum[i]:
                for p in range(1, std + 1):
                    cumsum[-1].append(q-p)
    cumsum = cumsum[cnt:]

    return cumsum                               # [[4, 11, 18, 25], [3, 7, 11, 15, 19, 23, 27], [5, 12, 19, 26, 4, 3, 11, 10, 18, 17, 25, 24]]


def solution(signals):
    cumsum = get_cumsum(signals)
    is_common = set(cumsum[0]).intersection(*cumsum[1:])
    is_common = sorted(list(is_common))
    
    if is_common:
        return is_common[0]
    else:
        return -1


if __name__ == '__main__':
    signals = [[1, 2, 1], [1, 1, 1], [2, 1, 1]] # [[2, 1, 2], [5, 1, 1]]
    print(solution(signals))

# [[2, 1, 2], [5, 1, 1]]	13
# [[2, 3, 2], [3, 1, 3], [2, 1, 1]]	11           7,7,4 => 28
# [[3, 3, 3], [5, 4, 2], [2, 1, 2]]	193
# [[1, 1, 4], [2, 1, 3], [3, 1, 2], [4, 1, 1]]	-1 

"""
1) 2 3 5/ 7 8 10/ 12 13 15/ 17 18 20/ 22 23 25/ 27 28 30/ 32 33 35
2) 5 6 7/ 12 13 14/ 19 20 21/ 26 27 28/ 33 34 35

1) [3, 8, 13, 18, 23, 28, 33] -> int(lcm/sum(signal))번 반복 == 7 // 공비: sum(signal) == 5 // 초항: signal[0] + signal[1] == 3 => 3, 3 + (5 * i == 1)
2) [6, 13, 20, 27, 34]
"""

"""
1) 2 5(3,4,5) 7/ 9 12(10,11,12) 14/ 16 19(17,18,19) 21/ 23 26(24,25,26) 28
2) 3 4 7/ 10 11 14/ 17 18 21/ 24 25 28
3) 2 3 4/ 6 7 8/ 10 11 12/ 14 15 16/ 18 19 20/ 22 23 24/ 26 27 28

0) [5, 12, 19, 26]
1) [3, 4, 5, 10, 11, 12, 17, 18, 19, 24, 25, 26]
2) [4, 11, 18, 25]
3) [3, 7, 11, 15, 19, 23, 27]
"""
"""
[[5, 12, 19, 26, 33, 40, 47, 54, 61, 68, 75, 82, 89, 96, 103, 110, 117, 124, 131, 138, 145, 152, 159, 166, 173, 180, 187, 194], 
[4, 11, 18, 25, 32, 39, 46, 53, 60, 67, 74, 81, 88, 95, 102, 109, 116, 123, 130, 137, 144, 151, 158, 165, 172, 179, 186, 193], 
[3, 7, 11, 15, 19, 23, 27, 31, 35, 39, 43, 47, 51, 55, 59, 63, 67, 71, 75, 79, 83, 87, 91, 95, 99, 103, 107, 111, 115, 119, 123, 127, 131, 135, 139, 143, 147, 151, 155, 159, 163, 167, 171, 175, 179, 183, 187, 191, 195, 4, 3, 11, 10, 18, 17, 25, 24, 32, 31, 39, 38, 46, 45, 53, 52, 60, 59, 67, 66, 74, 73, 81, 80, 88, 87, 95, 94, 102, 101, 109, 108, 116, 115, 123, 122, 130, 129, 137, 136, 144, 143, 151, 150, 158, 157, 165, 164, 172, 171, 179, 178, 186, 185, 193, 192]]
"""
